Autodesk.Revit.DB.Structure.RebarContainerItem.SetHookOrientation(System.Int32,Autodesk.Revit.DB.Structure.RebarHookOrientation)
Sets the orientation of the hook plane at the start or at the end of the rebar with respect to the orientation of the first or the last curve and the plane normal.
Remarks:
If RebarShapeDefinesHooks property of ReinforcementSettings is true (non-European shapes), setHookOrientation method does nothing.
end:
0 for the start hook, 1 for the end hook.
hookOrientation:
Only two values are permitted:
Value = Right: The hook is on your right as you stand at the end of the bar,
with the bar behind you, taking the bar's normal as "up."
Value = Left: The hook is on your left as you stand at the end of the bar,
with the bar behind you, taking the bar's normal as "up."
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
end must be 0 or 1.
-or-
A value passed for an enumeration argument is not a member of that enumeration
Since:
2016

Autodesk.Revit.DB.Structure.RebarContainerItem.GetHookOrientation(System.Int32)
Returns the orientation of the hook plane at the start or at the end of the rebar with respect to the orientation of the first or the last curve and the plane normal.
end:
0 for the start hook, 1 for the end hook.
Returns:
Value = Right: The hook is on your right as you stand at the end of the bar,
with the bar behind you, taking the bar's normal as "up."
Value = Left: The hook is on your left as you stand at the end of the bar,
with the bar behind you, taking the bar's normal as "up."
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
end must be 0 or 1.
Since:
2016

Autodesk.Revit.DB.Structure.RebarContainerItem.SetFromCurvesAndShape(Autodesk.Revit.DB.Structure.RebarShape,Autodesk.Revit.DB.Structure.RebarBarType,Autodesk.Revit.DB.Structure.RebarHookType,Autodesk.Revit.DB.Structure.RebarHookType,Autodesk.Revit.DB.XYZ,System.Collections.Generic.IList{Autodesk.Revit.DB.Curve},Autodesk.Revit.DB.Structure.RebarHookOrientation,Autodesk.Revit.DB.Structure.RebarHookOrientation)
Set an instance of a RebarContainerItem element according to the parameters list.
The instance will have the default shape parameters from the RebarShape.
If the RebarShapeDefinesHooks flag in ReinforcementSettings has been set to true,
then both the curves and hooks must match the RebarShape definition.
Otherwise, the hooks can be different than the defaults specified in the RebarShape
rebarShape:
A RebarShape element that defines the shape of the rebar.
A RebarShape element matches curves and hooks.
A RebarShape element provides RebarStyle of the rebar.
barType:
A RebarBarType element that defines bar diameter, bend radius and material of the rebar.
startHook:
A RebarHookType element that defines the hook for the start of the bar.
If this parameter is null, it means to create a rebar with no hook.
endHook:
A RebarHookType element that defines the hook for the end of the bar.
If this parameter is null, it means to create a rebar with no hook.
norm:
The normal to the plane that the rebar curves lie on.
curves:
An array of curves that define the shape of the rebar curves.
They must belong to the plane defined by the normal and origin.
Bends and hooks should not be included in the array of curves.
startHookOrient:
Defines the orientation of the hook plane at the start of the rebar with respect to the orientation of the first curve and the plane normal.
Only two values are permitted:
Value = Right: The hook is on your right as you stand at the end of the bar,
with the bar behind you, taking the bar's normal as "up."
Value = Left: The hook is on your left as you stand at the end of the bar,
with the bar behind you, taking the bar's normal as "up."
endHookOrient:
Defines the orientation of the hook plane at the end of the rebar with respect to the orientation of the last curve and the plane normal.
Only two values are permitted:
Value = Right: The hook is on your right as you stand at the end of the bar,
with the bar behind you, taking the bar's normal as "up."
Value = Left: The hook is on your left as you stand at the end of the bar,
with the bar behind you, taking the bar's normal as "up."
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input curves is empty.
-or-
The input curves contains at least one curve which is not a bound Line or bound Arc
and is not supported for this operation.
-or-
curves do not form a valid CurveLoop.
-or-
The input curves contains at least one helical curve and is not supported for this operation.
-or-
A RebarContainerItem cannot be created from a Rebar Shape that has End Treatments or Cranks or terminations' rotation angles are different than 0.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
norm has zero length.
-or-
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
curves contains non-fillet arcs with radii that are less than the
minimum bend radius for the RebarBarType and RebarShape style.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
rebarShape does not match curves.
Since:
2016

Autodesk.Revit.DB.Structure.RebarContainerItem.SetFromRebar(Autodesk.Revit.DB.Structure.Rebar)
Set an instance of a RebarContainerItem element according to a Rebar parameters.
Will throw exception if given rebar is not shape driven.
Will throw exception if given rebar has moved bars in set.
rebar:
The Rebar.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Can't create container from Rebar with moved bars.
-or-
Can't create container from Rebar which has excluded bars other than the first and last one.
-or-
A RebarContainerItem cannot be created from a Free Form Rebar or from a Shape Driven Rebar whose Rebar Shape has End Treatments or Cranks or terminations' rotation angles are different than 0.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2016